benchmarks/results/2026-08-29-709-diagnosis/lxc-container-to-container/wrk-off-keepalive.txt
Running 15s test @ http://192.168.86.56:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.59ms  486.62us   7.80ms   75.41%
    Req/Sec     2.24k   274.32     8.78k    97.17%
  Latency Distribution
     50%    3.58ms
     75%    3.86ms
     90%    4.16ms
     99%    4.78ms
  133767 requests in 15.10s, 72.33MB read
Requests/sec:   8859.23
Transfer/sec:      4.79MB