benchmarks/results/2026-08-29-709-diagnosis/lxc-container-to-container/wrk-response-workers32.txt
Running 15s test @ http://192.168.86.56:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    37.07ms  149.34ms   1.48s    96.28%
    Req/Sec   423.28    484.80     2.64k    83.05%
  Latency Distribution
     50%    5.85ms
     75%   16.62ms
     90%   31.94ms
     99%  950.19ms
  23634 requests in 15.09s, 13.10MB read
Requests/sec:   1566.13
Transfer/sec:      0.87MB