benchmarks/results/2026-08-29-709-diagnosis/lxc-container-to-container/wrk-response-workers4.txt
Running 15s test @ http://192.168.86.56:8069/proxy/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.06ms   10.13ms  63.73ms   80.50%
    Req/Sec   415.76    472.18     1.65k    81.98%
  Latency Distribution
     50%    6.28ms
     75%   14.43ms
     90%   28.46ms
     99%   40.69ms
  23918 requests in 15.05s, 13.25MB read
Requests/sec:   1589.14
Transfer/sec:      0.88MB

Post-run /status/metrics snapshot: upstream_connections_new_total=24,
upstream_connections_reused_total=23920 (out of 23918 requests -- local
origin economics essentially unaffected), accepts_total=23953 (~1:1 with
requests, confirming full downstream churn), worker_active_jobs=0 idle
after run, worker_threads=4.