benchmarks/results/2026-08-29-709-diagnosis/lxc-container-to-container/wrk-static.txt
Running 10s test @ http://192.168.86.56:8069/health
  4 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   548.48us  684.46us  14.30ms   89.69%
    Req/Sec    19.68k     1.30k   25.05k    76.75%
  Latency Distribution
     50%  251.00us
     75%  658.00us
     90%    1.25ms
     99%    3.20ms
  783503 requests in 10.01s, 434.84MB read
Requests/sec:  78310.10
Transfer/sec:     43.46MB